zachto = {'й':'Й','ц':'Ц','у':'У','к':'К','е':'Е','н':'Н','г':'Г','ш':'Ш','щ':'Щ','з':'З','х':'Х','ъ':'Ъ','ф':'Ф','ы':'Ы','в':'В','а':'А','п':'П','р':'Р','о':'О','л':'Л','д':'Д','ж':'Ж','э':'Э','я':'Я','ч':'Ч','с':'С','м':'М','и':'И','т':'Т','ь':'Ь','б':'Б','ю':'Ю','q':'Q','w':'W','e':'E','r':'R','t':'T','y':'Y','u':'U','i':'I','o':'O','p':'P','a':'A','s':'S','d':'D','f':'F','g':'G','h':'H','j':'J','k':'K','l':'L','z':'Z','x':'X','c':'C','v':'V','b':'B','n':'N','m':'M'}

string = input("Введите строку(пж): ")
print('Ваша строка: ',string)
upstr = ''

for el in range(0,len(string)):
    try:
        upstr += zachto[string[el]]
    except KeyError: 
        upstr+= string[el]
        
print('\n',f'Ваша строка: {string}\n Но так будет лучше: {upstr}','\n')