geo_dict = {"Москва":"Россия","Екатеренгбург":"Россия","Ростов":"Россия",
            "Владивосток":"Россия","Омск":"Россия","Краснодар":"Россия",
            "Даллас":"США","Дан":"США","Вашингтон":"США",
            "Сиэтл":"США","Чикаго":"США","Хьюстон":"США",
            }


while True:
    city = input("Введите название города: ")
    city = city[0].upper() + city[1:].lower()

    if city in geo_dict:
        #country = geo_dict.get(city)
        country = geo_dict[city]
        print("Страна:", country)
    else:
        print("Город не найден.")
